In [1]:
import numpy as np
import pandas as pd

In [3]:
# we can createt multiindex series as follows
index_col = [('cse', 2019), ('cse', 2020), ('cse', 2021), ('cse', 2022), ('ece', 2019), ('ece', 2020), ('ece', 2021), ('ece', 2022)]
a = pd.Series([1, 2, 3, 4, 5, 6, 7, 8], index = index_col)
a

(cse, 2019)    1
(cse, 2020)    2
(cse, 2021)    3
(cse, 2022)    4
(ece, 2019)    5
(ece, 2020)    6
(ece, 2021)    7
(ece, 2022)    8
dtype: int64

In [4]:
# if we want to fetch eleements
a[('cse'), 2019]

1

In [5]:
# if we want to fetch all cse elements
a['cse']

KeyError: 'cse'

In [6]:
# so actually above is not the correct way or optimum way to createt a multiindex series
# here is the correct way, first we will createt multindex object(heirarchy index), then we will createt the series
multi = pd.MultiIndex.from_tuples(index_col)
multi

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [8]:
# we can even create like this
pd.MultiIndex.from_product([['cse', 'ece'], [2019, 2020, 2021, 2022]])

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [9]:
# we can even get the levels of this
multi.levels

FrozenList([['cse', 'ece'], [2019, 2020, 2021, 2022]])

In [10]:
multi.levels[0]

Index(['cse', 'ece'], dtype='object')

In [11]:
multi.levels[1]

Index([2019, 2020, 2021, 2022], dtype='int64')

In [12]:
# now we can make series by using this multiindexed object
ser = pd.Series([1, 2, 3, 4, 5, 6, 7, 8], index = multi)
ser

cse  2019    1
     2020    2
     2021    3
     2022    4
ece  2019    5
     2020    6
     2021    7
     2022    8
dtype: int64

In [15]:
# accessing eleements
ser[('cse', 2020)]

2

In [16]:
# we can even extract all cse rows at once
ser['cse']

2019    1
2020    2
2021    3
2022    4
dtype: int64

In [17]:
# we cna even convert this into dataframe by 2 ways
ser.reset_index()

  level_0  level_1  0
0     cse     2019  1
1     cse     2020  2
2     cse     2021  3
3     cse     2022  4
4     ece     2019  5
5     ece     2020  6
6     ece     2021  7
7     ece     2022  8

In [18]:
ser.unstack()

     2019  2020  2021  2022
cse     1     2     3     4
ece     5     6     7     8

In [20]:
# we can convert a dataframe into multiindexed object
ser.unstack().stack()

cse  2019    1
     2020    2
     2021    3
     2022    4
ece  2019    5
     2020    6
     2021    7
     2022    8
dtype: int64

In [23]:
# ther eason why we use multiindexed series or dataframe is we can squash higher dimensional data into lower dimesnions, 3d data into 2d dataframe
# craeting a  multitindexed dataframe
df1 = pd.DataFrame(
        [
            [1, 2],
            [3, 4],
            [5, 6], 
            [7, 8], 
            [9, 10], 
            [11, 12], 
            [13, 14],
            [15, 16]
        ],
index = multi, columns = ['package', 'no_of_students'])
df1

          package  no_of_students
cse 2019        1               2
    2020        3               4
    2021        5               6
    2022        7               8
ece 2019        9              10
    2020       11              12
    2021       13              14
    2022       15              16

In [25]:
# accessing all elements
df1.loc[('cse', 2019), 'package']

1

In [28]:
df1.loc['cse']

      package  no_of_students
2019        1               2
2020        3               4
2021        5               6
2022        7               8

In [29]:
# if we want all 2019 values
df1.xs(2019, level = 1)

     package  no_of_students
cse        1               2
ece        9              10

In [31]:
df1.xs('cse', level = 0)

      package  no_of_students
2019        1               2
2020        3               4
2021        5               6
2022        7               8

In [33]:
df1.xs((2019, 2020), level = 1)

KeyError: (2019, 2020)

In [43]:
# we can even create a multiindexed column object also
df2 = pd.DataFrame(
        [
            [1, 2, 0, 0],
            [3, 4, 0, 0],
            [5, 6, 0, 0,],
            [7, 8, 0, 0]
        ],
    index = [2019, 2020, 2021, 2022],
    columns = pd.MultiIndex.from_product([['delhi', 'mumbai'], ['package', 'students']])
)
df2

       delhi           mumbai
     package students package students
2019       1        2       0        0
2020       3        4       0        0
2021       5        6       0        0
2022       7        8       0        0

In [45]:
# accessing
df2['delhi']

      package  students
2019        1         2
2020        3         4
2021        5         6
2022        7         8

In [46]:
df2['delhi']['students']

2019    2
2020    4
2021    6
2022    8
Name: students, dtype: int64

In [54]:
df2.loc[2019, 'delhi']['package']

1

In [55]:
df2.loc[[2019, 2020], ['delhi', 'mumbai']]

       delhi           mumbai
     package students package students
2019       1        2       0        0
2020       3        4       0        0

In [63]:
df2.loc[[2019, 2020],'delhi']

      package  students
2019        1         2
2020        3         4

In [64]:
# whenever accessing elements remeeber what it is returing at 1st level, then based on that it is easy
df3 = pd.DataFrame(
        [
            [1, 2, 0, 0],
            [3, 4, 0, 0],
            [5, 6, 0, 0,],
            [7, 8, 0, 0],
            [11, 12, 0, 0],
            [13, 14, 0, 0],
            [15, 16, 0, 0,],
            [17, 18, 0, 0]
        ],
    index = multi,
    columns = pd.MultiIndex.from_product([['delhi', 'mumbai'], ['package', 'students']])
)
df3

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
    2021       5        6       0        0
    2022       7        8       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0
    2021      15       16       0        0
    2022      17       18       0        0

In [65]:
# accessing 
df3['delhi']

          package  students
cse 2019        1         2
    2020        3         4
    2021        5         6
    2022        7         8
ece 2019       11        12
    2020       13        14
    2021       15        16
    2022       17        18

In [66]:
df3['delhi']['students']

cse  2019     2
     2020     4
     2021     6
     2022     8
ece  2019    12
     2020    14
     2021    16
     2022    18
Name: students, dtype: int64

In [67]:
df3.loc['cse', 'delhi']

      package  students
2019        1         2
2020        3         4
2021        5         6
2022        7         8

In [69]:
df3.loc[[('cse', 2019), ('ece', 2019)], 'delhi']

          package  students
cse 2019        1         2
ece 2019       11        12

In [70]:
df3.loc[[('cse', 2019), ('ece', 2019)], 'delhi']['package']

cse  2019     1
ece  2019    11
Name: package, dtype: int64

In [78]:
df3[[['delhi','package'], ['mumbai', 'package']]].loc[[('cse', 2019), ('ece', 2022)]]

           delhi  mumbai
         package package
cse 2019       1       0
ece 2022      17       0

In [79]:
df3

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
    2021       5        6       0        0
    2022       7        8       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0
    2021      15       16       0        0
    2022      17       18       0        0

In [83]:
# if we want all 2019 package values
df3.xs(2019, level = 1).xs('package', level = 1, axis = 1)

     delhi  mumbai
cse      1       0
ece     11       0

In [109]:
# if we want multiple values
temp = df3[df3.index.get_level_values(1).isin([2019, 2020])]
temp

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0

In [110]:
# to get all 2019, 2020 package and students values
temp[temp.columns.get_level_values(1).isin(['package', 'students'])]

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0

In [115]:
# only to get package values from both cities
temp.xs('package', level = 1, axis = 1)

          delhi  mumbai
cse 2019      1       0
    2020      3       0
ece 2019     11       0
    2020     13       0

In [116]:
# to get single value use xs, for multiple values use isin function in conjuction with some other functions like index.get_level_values, columns.get_level_values

In [118]:
# whenever we use unstack , outer will become intack inner will converrt from, row into column and also if already columns are tehre, it will multitindexed colum,n
df1

          package  no_of_students
cse 2019        1               2
    2020        3               4
    2021        5               6
    2022        7               8
ece 2019        9              10
    2020       11              12
    2021       13              14
    2022       15              16

In [119]:
df1.unstack()

    package                no_of_students
       2019 2020 2021 2022           2019 2020 2021 2022
cse       1    3    5    7              2    4    6    8
ece       9   11   13   15             10   12   14   16

In [121]:
df1.unstack().unstack()

package         2019  cse     1
                      ece     9
                2020  cse     3
                      ece    11
                2021  cse     5
                      ece    13
                2022  cse     7
                      ece    15
no_of_students  2019  cse     2
                      ece    10
                2020  cse     4
                      ece    12
                2021  cse     6
                      ece    14
                2022  cse     8
                      ece    16
dtype: int64

In [122]:
# same reverse
df1

          package  no_of_students
cse 2019        1               2
    2020        3               4
    2021        5               6
    2022        7               8
ece 2019        9              10
    2020       11              12
    2021       13              14
    2022       15              16

In [123]:
df1.stack()

cse  2019  package            1
           no_of_students     2
     2020  package            3
           no_of_students     4
     2021  package            5
           no_of_students     6
     2022  package            7
           no_of_students     8
ece  2019  package            9
           no_of_students    10
     2020  package           11
           no_of_students    12
     2021  package           13
           no_of_students    14
     2022  package           15
           no_of_students    16
dtype: int64

In [124]:
# stacking and unstacking vice versa and just practise and remember
df2

       delhi           mumbai
     package students package students
2019       1        2       0        0
2020       3        4       0        0
2021       5        6       0        0
2022       7        8       0        0

In [125]:
df2.unstack()

delhi   package   2019    1
                  2020    3
                  2021    5
                  2022    7
        students  2019    2
                  2020    4
                  2021    6
                  2022    8
mumbai  package   2019    0
                  2020    0
                  2021    0
                  2022    0
        students  2019    0
                  2020    0
                  2021    0
                  2022    0
dtype: int64

In [126]:
df2.stack()

C:\Users\gpava\AppData\Local\Temp\ipykernel_6000\406340214.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df2.stack()

               delhi  mumbai
2019 package       1       0
     students      2       0
2020 package       3       0
     students      4       0
2021 package       5       0
     students      6       0
2022 package       7       0
     students      8       0

In [127]:
df2.stack().stack()

C:\Users\gpava\AppData\Local\Temp\ipykernel_6000\3971620733.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df2.stack().stack()

2019  package   delhi     1
                mumbai    0
      students  delhi     2
                mumbai    0
2020  package   delhi     3
                mumbai    0
      students  delhi     4
                mumbai    0
2021  package   delhi     5
                mumbai    0
      students  delhi     6
                mumbai    0
2022  package   delhi     7
                mumbai    0
      students  delhi     8
                mumbai    0
dtype: int64

In [129]:
df3

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
    2021       5        6       0        0
    2022       7        8       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0
    2021      15       16       0        0
    2022      17       18       0        0

In [130]:
df3.unstack()

      delhi                                         mumbai                 \
    package                students                package
       2019 2020 2021 2022     2019 2020 2021 2022    2019 2020 2021 2022
cse       1    3    5    7        2    4    6    8       0    0    0    0
ece      11   13   15   17       12   14   16   18       0    0    0    0


    students
        2019 2020 2021 2022
cse        0    0    0    0
ece        0    0    0    0

In [131]:
df3.unstack().unstack()

delhi   package   2019  cse     1
                        ece    11
                  2020  cse     3
                        ece    13
                  2021  cse     5
                        ece    15
                  2022  cse     7
                        ece    17
        students  2019  cse     2
                        ece    12
                  2020  cse     4
                        ece    14
                  2021  cse     6
                        ece    16
                  2022  cse     8
                        ece    18
mumbai  package   2019  cse     0
                        ece     0
                  2020  cse     0
                        ece     0
                  2021  cse     0
                        ece     0
                  2022  cse     0
                        ece     0
        students  2019  cse     0
                        ece     0
                  2020  cse     0
                        ece     0
                  2021  cse     0
                        ece     0
                  2022  cse     0
                        ece     0
dtype: int64

In [132]:
df3

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
    2021       5        6       0        0
    2022       7        8       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0
    2021      15       16       0        0
    2022      17       18       0        0

In [133]:
df3.stack()

C:\Users\gpava\AppData\Local\Temp\ipykernel_6000\4025673574.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df3.stack()

                   delhi  mumbai
cse 2019 package       1       0
         students      2       0
    2020 package       3       0
         students      4       0
    2021 package       5       0
         students      6       0
    2022 package       7       0
         students      8       0
ece 2019 package      11       0
         students     12       0
    2020 package      13       0
         students     14       0
    2021 package      15       0
         students     16       0
    2022 package      17       0
         students     18       0

In [134]:
df3.stack().stack()

C:\Users\gpava\AppData\Local\Temp\ipykernel_6000\1373632913.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df3.stack().stack()

cse  2019  package   delhi      1
                     mumbai     0
           students  delhi      2
                     mumbai     0
     2020  package   delhi      3
                     mumbai     0
           students  delhi      4
                     mumbai     0
     2021  package   delhi      5
                     mumbai     0
           students  delhi      6
                     mumbai     0
     2022  package   delhi      7
                     mumbai     0
           students  delhi      8
                     mumbai     0
ece  2019  package   delhi     11
                     mumbai     0
           students  delhi     12
                     mumbai     0
     2020  package   delhi     13
                     mumbai     0
           students  delhi     14
                     mumbai     0
     2021  package   delhi     15
                     mumbai     0
           students  delhi     16
                     mumbai     0
     2022  package   delhi     17
                     mumbai     0
           students  delhi     18
                     mumbai     0
dtype: int64

In [135]:
# anything we do for a datyafarme also applicable here
df3

           delhi           mumbai
         package students package students
cse 2019       1        2       0        0
    2020       3        4       0        0
    2021       5        6       0        0
    2022       7        8       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0
    2021      15       16       0        0
    2022      17       18       0        0

In [136]:
df3.duplicated()

cse  2019    False
     2020    False
     2021    False
     2022    False
ece  2019    False
     2020    False
     2021    False
     2022    False
dtype: bool

In [137]:
df3.isnull()

           delhi           mumbai
         package students package students
cse 2019   False    False   False    False
    2020   False    False   False    False
    2021   False    False   False    False
    2022   False    False   False    False
ece 2019   False    False   False    False
    2020   False    False   False    False
    2021   False    False   False    False
    2022   False    False   False    False

In [140]:
# sorting the index
df3.sort_index(ascending = False)

           delhi           mumbai
         package students package students
ece 2022      17       18       0        0
    2021      15       16       0        0
    2020      13       14       0        0
    2019      11       12       0        0
cse 2022       7        8       0        0
    2021       5        6       0        0
    2020       3        4       0        0
    2019       1        2       0        0

In [141]:
# we can even sort one level asc, one level desc
df3.sort_index(ascending = [True, False])

           delhi           mumbai
         package students package students
cse 2022       7        8       0        0
    2021       5        6       0        0
    2020       3        4       0        0
    2019       1        2       0        0
ece 2022      17       18       0        0
    2021      15       16       0        0
    2020      13       14       0        0
    2019      11       12       0        0

In [142]:
# let's say we want to do sorting only on particular levels
df3.sort_index(ascending = False, level = 1)

           delhi           mumbai
         package students package students
ece 2022      17       18       0        0
cse 2022       7        8       0        0
ece 2021      15       16       0        0
cse 2021       5        6       0        0
ece 2020      13       14       0        0
cse 2020       3        4       0        0
ece 2019      11       12       0        0
cse 2019       1        2       0        0

In [144]:
# we can even swap levels
df3.swaplevel()

           delhi           mumbai
         package students package students
2019 cse       1        2       0        0
2020 cse       3        4       0        0
2021 cse       5        6       0        0
2022 cse       7        8       0        0
2019 ece      11       12       0        0
2020 ece      13       14       0        0
2021 ece      15       16       0        0
2022 ece      17       18       0        0

In [145]:
df3.swaplevel(axis = 1)

         package students package students
           delhi    delhi  mumbai   mumbai
cse 2019       1        2       0        0
    2020       3        4       0        0
    2021       5        6       0        0
    2022       7        8       0        0
ece 2019      11       12       0        0
    2020      13       14       0        0
    2021      15       16       0        0
    2022      17       18       0        0

In [146]:
# transose
df3.transpose()

                 cse                 ece
                2019 2020 2021 2022 2019 2020 2021 2022
delhi  package     1    3    5    7   11   13   15   17
       students    2    4    6    8   12   14   16   18
mumbai package     0    0    0    0    0    0    0    0
       students    0    0    0    0    0    0    0    0

In [148]:
# melt converts wide data into long data
x = pd.DataFrame(
        {
            'cse': [200],
            'ece' : [120]
        }
)
x

   cse  ece
0  200  120

In [149]:
# above is wide data fromat, convering this to long data
x.melt()

  variable  value
0      cse    200
1      ece    120

In [150]:
x = pd.DataFrame(
    {
        'cse' : [100, 200, 120, 150],
        'ece' : [120, 150, 160, 180],
        'year' : [2020, 2021, 2022, 2023]
    }
)
x

   cse  ece  year
0  100  120  2020
1  200  150  2021
2  120  160  2022
3  150  180  2023

In [151]:
# we can again convert this to long data
x.melt()

   variable  value
0       cse    100
1       cse    200
2       cse    120
3       cse    150
4       ece    120
5       ece    150
6       ece    160
7       ece    180
8      year   2020
9      year   2021
10     year   2022
11     year   2023

In [153]:
# but above format is not clear, we just want to converty cse, ece into rows but not year
x.melt(id_vars = ['year'], var_name = 'branch', value_name = 'students')

   year branch  students
0  2020    cse       100
1  2021    cse       200
2  2022    cse       120
3  2023    cse       150
4  2020    ece       120
5  2021    ece       150
6  2022    ece       160
7  2023    ece       180

In [155]:
# covid data
deaths = pd.read_csv('time_series_covid19_deaths_global.csv')
confirmed = pd.read_csv('time_series_covid19_confirmed_global.csv')

In [156]:
deaths.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,12/24/22,12/25/22,12/26/22,12/27/22,12/28/22,12/29/22,12/30/22,12/31/22,1/1/23,1/2/23
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,7845,7846,7846,7846,7846,7847,7847,7849,7849,7849
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,3595,3595,3595,3595,3595,3595,3595,3595,3595,3595
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,6881,6881,6881,6881,6881,6881,6881,6881,6881,6881
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,165,165,165,165,165,165,165,165,165,165
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,1928,1928,1928,1930,1930,1930,1930,1930,1930,1930

In [157]:
confirmed.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,12/24/22,12/25/22,12/26/22,12/27/22,12/28/22,12/29/22,12/30/22,12/31/22,1/1/23,1/2/23
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,207310,207399,207438,207460,207493,207511,207550,207559,207616,207627
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,333749,333749,333751,333751,333776,333776,333806,333806,333811,333812
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,271194,271198,271198,271202,271208,271217,271223,271228,271229,271229
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,47686,47686,47686,47686,47751,47751,47751,47751,47751,47751
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,104973,104973,104973,105095,105095,105095,105095,105095,105095,105095

In [158]:
#if we observe above both tables are wide data and it is very difficult to work
# conveting above data with columns as country, date, conrimed, deaths
deaths = deaths.melt(id_vars= ['Province/State', 'Country/Region', 'Lat', 'Long'], var_name = 'date', value_name = 'number')
deaths

,Province/State,Country/Region,Lat,Long,date,number
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
311248,NaN,West Bank and Gaza,31.952200,35.233200,1/2/23,5708
311249,NaN,Winter Olympics 2022,39.904200,116.407400,1/2/23,0
311250,NaN,Yemen,15.552727,48.516388,1/2/23,2159
311251,NaN,Zambia,-13.133897,27.849332,1/2/23,4024
311252,NaN,Zimbabwe,-19.015438,29.154857,1/2/23,5637

In [161]:
confirmed = confirmed.melt(id_vars= ['Province/State', 'Country/Region', 'Lat', 'Long'], var_name = 'date', value_name = 'number')
confirmed

,Province/State,Country/Region,Lat,Long,date,number
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
311248,NaN,West Bank and Gaza,31.952200,35.233200,1/2/23,703228
311249,NaN,Winter Olympics 2022,39.904200,116.407400,1/2/23,535
311250,NaN,Yemen,15.552727,48.516388,1/2/23,11945
311251,NaN,Zambia,-13.133897,27.849332,1/2/23,334661
311252,NaN,Zimbabwe,-19.015438,29.154857,1/2/23,259981

In [164]:
# now joining two tables
covid = confirmed.merge(deaths, how = 'inner', on = ['Province/State', 'Country/Region', 'Lat', 'Long', 'date'])

In [168]:
covid.rename(columns = {'number_x': 'confirmed_cases', 'number_y' : 'death_cases'}, inplace = True)

In [173]:
covid = covid[['Country/Region', 'date', 'confirmed_cases', 'death_cases']]
covid

              Country/Region     date  confirmed_cases  death_cases
0                Afghanistan  1/22/20                0            0
1                    Albania  1/22/20                0            0
2                    Algeria  1/22/20                0            0
3                    Andorra  1/22/20                0            0
4                     Angola  1/22/20                0            0
...                      ...      ...              ...          ...
311248    West Bank and Gaza   1/2/23           703228         5708
311249  Winter Olympics 2022   1/2/23              535            0
311250                 Yemen   1/2/23            11945         2159
311251                Zambia   1/2/23           334661         4024
311252              Zimbabwe   1/2/23           259981         5637

[311253 rows x 4 columns]